{"translation-revision-date":"2024-12-13T16:52:58+00:00","generator":"WP-CLI\/2.11.0","source":"dist\/package\/business\/srfmUserRegistration.js","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","lang":"en","plural-forms":"nplurals=2; plural=(n != 1);"},"Back":["Atrás"],"Select":["Seleccionar"],"Cancel":["Cancelar"],"Activate License":["Activar licencia"],"Delete":["Eliminar"],"Edit":["Editar"],"Error":["Error"],"Enable Custom Registration Page ":["Habilitar página de registro personalizada"],"Enable this to assign your Custom Registration page and offer a personalized sign-up experience.":["Habilita esto para asignar tu página de registro personalizada y ofrecer una experiencia de inscripción personalizada."],"Select Registration Page":["Seleccionar página de registro"],"Enable Custom Login Page ":["Habilitar página de inicio de sesión personalizada"],"Enable this to assign your Custom Login page and offer a personalized log-in experience.":["Habilita esto para asignar tu página de inicio de sesión personalizada y ofrecer una experiencia de inicio de sesión personalizada."],"Select Login Page":["Seleccionar página de inicio de sesión"],"Search for a page":["Buscar una página"],"Login\/Registration":["Inicio de sesión\/Registro"],"Actions":["Acciones"],"Password Strength Weak":["Fortaleza de la contraseña débil"],"Password Strength Moderate":["Fortaleza de la contraseña moderada"],"Password Strength Strong":["Fortaleza de la contraseña: fuerte"],"Password Strength Very Strong":["Fortaleza de la contraseña: Muy fuerte"],"Confirmation Password Mismatch":["La confirmación de la contraseña no coincide"],"Password Block":["Bloqueo de contraseña"],"License Key":["Clave de licencia"],"Paste your license key here":["Pega tu clave de licencia aquí"],"Please enter a license key":["Por favor, introduzca una clave de licencia"],"Webhooks":["Webhooks"],"Signature Block File Size Exceed":["El tamaño del archivo del bloque de firma excede"],"The %s shows the max file size. For example: “File size should not exceed 2 MB.”":["El %s muestra el tamaño máximo del archivo. Por ejemplo: \"El tamaño del archivo no debe exceder los 2 MB.\""],"Signature Block File Type Not Allowed":["Tipo de archivo de bloque de firma no permitido"],"Signature Block Invalid Value":["Valor de bloque de firma no válido"],"Upload Block File Size Exceed":["El tamaño del archivo de bloque de carga excede"],"The %s shows the max file size. For example: “File size should not exceed 5 MB.”":["El %s muestra el tamaño máximo del archivo. Por ejemplo: \"El tamaño del archivo no debe exceder los 5 MB.\""],"Upload Block File Type Not Allowed":["Tipo de archivo de bloque de carga no permitido"],"Upload Block File Upload Limit":["Límite de carga de archivo de bloque"],"%s represents the max files allowed. For example: “You can only upload up to 3 files.”":["%s representa el máximo de archivos permitidos. Por ejemplo: \"Solo puedes subir hasta 3 archivos.\""],"Rating Block":["Bloque de calificación"],"Signature Block":["Bloque de firma"],"Date Picker Block":["Bloque de Selector de Fecha"],"Time Picker Block":["Bloque de Selector de Hora"],"Upload Block":["Bloque de carga"],"Slider Block":["Bloque deslizante"],"Please enter your license key below to activate!":["¡Por favor, introduzca su clave de licencia a continuación para activar!"],"Activate %1$s to get professional support and automatic updates from your WordPress dashboard. If you don't have a license, you can %2$s":["Activa %1$s para obtener soporte profesional y actualizaciones automáticas desde tu panel de WordPress. Si no tienes una licencia, puedes %2$s"],"get it here »":["consíguelo aquí »"],"Your license is activated":["Su licencia está activada"],"Deactivate":["Desactivar"],"License":["Licencia"],"Search integrations…":["Buscar integraciones…"],"Integration configured successfully!":["¡Integración configurada con éxito!"],"Failed to save integration. Please try again.":["Error al guardar la integración. Por favor, inténtalo de nuevo."],"Integration Details":["Detalles de la integración"],"Integrations":["Integraciones"],"Select the integration you want to configure for your form":["Seleccione la integración que desea configurar para su formulario"],"No integrations available":["No hay integraciones disponibles"],"Integrations have been disabled globally. Enable them in the global settings to connect your forms.":["Las integraciones han sido desactivadas globalmente. Actívalas en la configuración global para conectar tus formularios."],"No integrations found":["No se encontraron integraciones"],"Didn't find what you're looking for? Request your integration and we'll take it from there.":["¿No encontraste lo que buscas? Solicita tu integración y nosotros nos encargaremos del resto."],"Request Integration":["Solicitar integración"],"Saving…":["Guardando…"],"Save Changes":["Guardar cambios"],"Continue":["Continuar"],"Connect Your First Integration":["Conecta tu primera integración"],"You haven't set up any integrations yet. Boost productivity by linking SureForms to the tools you already use and love.":["Aún no has configurado ninguna integración. Aumenta la productividad vinculando SureForms con las herramientas que ya usas y amas."],"Send form submissions directly to your CRM, email, or marketing platforms":["Envía los envíos de formularios directamente a tu CRM, correo electrónico o plataformas de marketing"],"Keep your data updated and in sync across platforms instantly":["Mantén tus datos actualizados y sincronizados instantáneamente en todas las plataformas"],"Automate tasks and streamline workflows with native apps":["Automatiza tareas y optimiza flujos de trabajo con aplicaciones nativas"],"Connection":["Conexión"],"Created On":["Creado el"],"No Date":["Sin fecha"],"Delete Integration":["Eliminar integración"],"Are you sure you want to delete this integration? This action cannot be undone and will stop all data flow to this service.":["¿Está seguro de que desea eliminar esta integración? Esta acción no se puede deshacer y detendrá todo el flujo de datos hacia este servicio."],"Failed to load webhook settings":["Error al cargar la configuración del webhook"],"Using default values. Please refresh to try again.":["Usando valores predeterminados. Por favor, actualice para intentarlo de nuevo."],"Allow forms to send data to external webhook URLs":["Permitir que los formularios envíen datos a URLs de webhook externos"],"Save failed":["Guardado fallido"],"Webhooks enabled successfully!":["¡Webhooks habilitados con éxito!"],"Webhooks disabled successfully!":["¡Webhooks deshabilitados con éxito!"],"Failed to save webhook settings":["Error al guardar la configuración del webhook"],"Please try again.":["Por favor, inténtalo de nuevo."],"Toggle webhooks":["Alternar webhooks"],"An unexpected error occurred. Please try again.":["Ocurrió un error inesperado. Por favor, inténtelo de nuevo."],"Network error. Please check your connection and try again.":["Error de red. Por favor, verifica tu conexión e inténtalo de nuevo."],"There was an issue fetching integrations.":["Hubo un problema al obtener las integraciones."],"Failed to delete integration. Please try again.":["Error al eliminar la integración. Por favor, inténtelo de nuevo."],"Unable to test connection. Please try again.":["No se puede probar la conexión. Por favor, inténtelo de nuevo."],"Unable to load integration credentials. Please configure the integration first.":["No se pueden cargar las credenciales de integración. Por favor, configure primero la integración."],"Connection test failed. Please check your configuration.":["La prueba de conexión falló. Por favor, revise su configuración."],"Connection testing is not available for this integration type.":["La prueba de conexión no está disponible para este tipo de integración."],"Integration Added":["Integración añadida"],"Integration Updated":["Integración actualizada"],"Integration Deleted":["Integración eliminada"],"Integration has been successfully deleted.":["La integración ha sido eliminada con éxito."],"Integration connection is working properly.":["La conexión de integración está funcionando correctamente."],"Loading Error":["Error de carga"],"Save Error":["Error al guardar"],"Delete Error":["Error de eliminación"],"Test Failed":["Prueba fallida"],"Configuration Error":["Error de configuración"],"Connection Test Failed":["Prueba de conexión fallida"],"Connection Test Successful":["Prueba de conexión exitosa"],"Connection Test Not Available":["Prueba de conexión no disponible"],"Native integrations functionality not available":["Funcionalidad de integraciones nativas no disponible"],"Connection Name":["Nombre de la conexión"],"Test Connection":["Probar conexión"],"Add Integration":["Agregar integración"],"Unknown Integration":["Integración desconocida"],"Browse Integrations":["Explorar integraciones"],"Broadcast your SureForms submission to any web API endpoint with the powerful webhook module":["Transmite tu envío de SureForms a cualquier punto final de API web con el potente módulo de webhook"],"Onboard new users or update existing accounts through beautiful looking forms.":["Incorpora nuevos usuarios o actualiza cuentas existentes a través de formularios de aspecto atractivo."],"Great going! Your license is verified. You're all set to enjoy Premium features, updates, support and more.":["¡Vas muy bien! Tu licencia está verificada. Estás listo para disfrutar de las funciones Premium, actualizaciones, soporte y más."],"OAuth API handler not available.":["Manejador de API OAuth no disponible."],"Failed to get authorization URL.":["Error al obtener la URL de autorización."],"OAuth authentication failed.":["La autenticación OAuth falló."],"Integration ID not found.":["ID de integración no encontrado."],"Popup blocked. Please allow popups for this site.":["Popup bloqueado. Por favor, permita los popups para este sitio."],"OAuth authentication timed out.":["La autenticación OAuth se agotó."],"OAuth authentication was cancelled.":["La autenticación OAuth fue cancelada."],"Successfully connected!":["¡Conectado con éxito!"],"Authentication failed":["Autenticación fallida"],"Connecting…":["Conectando…"],"Connect":["Conectar"]}}}