{
    "name": "SureForms Starter",
    "slug": "sureforms-pro",
    "author": "<a href='https://sureforms.com'>SureForms</a>",
    "author_profile": "https://sureforms.com/",
    "version": "2.3.0",
    "requires": "6.4",
    "tested": "6.9",
    "requires_php": "7.4",
    "sections": {
        "description": "Adds powerful blocks for SureForms.",
        "changelog": "<h4>2.3.0 - 5th January 2026</h4><ul><li>New: Added Google Sheets integration.</li><li>New: Added MailerPress integration.</li><li>New: Added Keap integration.</li><li>New: Added Zoho CRM integration.</li><li>New: Added password-based form restriction.</li><li>Improvement: Added placeholder support across all fields.</li><li>Improvement: Added option to block past dates in the date picker field.</li><li>Improvement: Improved handling of rotating banners in email summaries.</li></ul><h4>2.2.0 - 16th December 2025</h4><ul><li>New: Introduced Save and Progress feature.</li><li>New: Added form restriction options based on IP, country, keywords, and user login.</li><li>New: Added Conditional Logic support for Native Integrations.</li><li>Improvement: Added time picker support in Repeater.</li><li>Improvement: Display option labels instead of values in workflow multi-select fields.</li><li>Improvement: Added hidden field values to the single entry view.</li><li>Improvement: Updated calculation output to auto-append trailing zeros when rounding is greater than 0.</li><li>Improvement: Optimized script loading to improve speed and efficiency.</li><li>Fix: Corrected default operator for date and time picker blocks in conditional logic.</li><li>Fix: Fixed UI issue with date picker when using the Etch theme.</li><li>Fix: Fixed page break buttons not working inside Elementor popups.</li><li>Fix: Fixed input mask not applying to text fields inside Repeater.</li></ul><h4>2.1.0 - 2nd December 2025</h4><ul><li>New: Added HubSpot integration.</li><li>New: Added MailPoet integration.</li><li>New: WP Fusion (3.47.3) integrates with SureForms.</li><li>Fix: Ensured compatibility with WordPress 6.9.</li><li>Fix: Entries files not getting deleted on deleting entries.</li></ul><h4>2.0.0 - 20th November 2025</h4><ul><li>Improvement: Revamped the SureForms UI.</li></ul><h4>1.13.2 - 7th November 2025</h4><ul><li>Fix: Fixed the Upload field validation issues.</li></ul><h4>1.13.1 - 24th October 2025</h4><ul><li>Fix: Fixed missing Webhooks integration settings.</li><li>Fix: Fixed required field issue in Kit and MailerLite integration.</li></ul><h4>1.13.0 - 14th October 2025</h4><ul><li>New: Introduced Native Integrations.</li></ul><h4>1.12.3 - 30th September 2025</h4><ul><li>Fix: Fixed error on form submission when upload field is left empty.</li><li>Fix: Form saving/publishing failed due to SureForms meta error.</li><li>Fix: Forms not publishing or saving with certain blocks on low PHP memory servers.</li></ul><h4>1.12.2 - 26th September 2025</h4><ul><li>Improvement: Enhanced admin permission check.</li><li>Improvement: Enhanced file upload type handling.</li><li>Fix: Resolved row gap issue in confirm email field inside Repeater field.</li></ul><h4>1.12.1 - 18th September 2025</h4><ul><li>Improvement: Added support of dropdown, phone number, URL, and date picker in repeater field.</li><li>Fix: Fixed issue preventing ZIP file uploads on Windows.</li></ul><h4>1.12.0 - 4th September 2025</h4><ul><li>New: Introduced Custom HTML field.</li><li>Fix: Fixed extra padding and double scroll issue when editing entries for forms with multiple fields.</li><li>Fix: Removed RAR file type support from upload fields.</li></ul><h4>1.11.0 - 2nd September 2025</h4><ul><li>New: Introduced Repeater field.</li><li>Fix: Submit button disable option no longer resets on refresh.</li><li>Fix: Resolved an issue where the date picker dropdown and page break button overlapped when BeTheme was active.</li></ul><h4>1.10.1 - 19th August 2025</h4><ul><li>New: Introduced Conditional Logic for Email Notification.</li><li>Improvement: Added a button to clear the minimum and maximum date values for the date picker block.</li><li>Improvement: Made the signature image viewable instead of displaying a \"View\" button.</li><li>Fix: Resolved a runtime error when all options were deleted from a text slider in the Editor.</li><li>Fix: Resolved an issue where error messages in form validation were not saving due to duplicate keys.</li><li>Fix: Webhook-selected fields were not saving in trigger conditions.</li></ul><h4>1.10.0 - 7th August 2025</h4><ul><li>New: Introduced CPT Creation in the Business Plan.</li><li>Fix: File types were not being uploaded even when allowed in the Upload field.</li><li>Fix: Resolved an issue where conditional logic was not preserved for duplicated blocks.</li><li>Fix: Resolved the nonce verification error with the auto-login feature.</li></ul><h4>1.9.0 - 22nd July 2025</h4><ul><li>New: Introduced PDF Generation.</li><li>Improvement: Updated OttoKit session ID cookie logic to set the cookie only for forms using the Custom App OttoKit feature.</li></ul><h4>1.8.0 - 10th July 2025</h4><ul><li>New: Introduced User Registration and Login.</li><li>New: Added Password field, integrated with Login and Register fields.</li><li>Improvement: Added license popup for AI Form Builder when license is inactive.</li><li>Fix: Resolved an issue with conditional logic popup displaying the entire HTML element when a link is added to a block label.</li><li>Fix: Addressed accessibility issues related to required field announcements.</li><li>Fix: Resolved an issue with functionality for text-type slider.</li><li>Fix: Resolved an issue where the calculations dropdown in the editor sidebar was not visible.</li></ul><h4>1.7.3 - 26th June 2025</h4><ul><li>Fix: Fixed conditional logic popup formatting issues when selecting date or time fields.</li><li>Fix: Addressed issues related to conditional logic not working correctly with hidden fields.</li><li>Fix: Resolved an issue where the form confirmation settings screen appeared blank after saving.</li></ul><h4>1.7.2 - 12th June 2025</h4><ul><li>Fix: Resolved an issue where changes to custom app settings were not being saved correctly in the OttoKit response configuration.</li><li>Fix: Resolved an overflow issue in conditional logic popup inputs by adding ellipsis for long options.</li></ul><h4>1.7.1 - 9th June 2025</h4><ul><li>Improvement: Enhanced resend email notification popup with informative messaging when no notifications are configured.</li><li>Fix: Addressed UI inconsistencies in the conditional logic editor for Multi Choice and Dropdown fields.</li></ul><h4>1.7.0 - 22nd May 2025</h4><ul><li>New: Revamped user interface for Dashboard and Settings with a more modern and intuitive experience.</li><li>New: Added box shadow customization for input fields.</li><li>Improvement: Slider Block now supports decimal step values (e.g., 0.1+).</li><li>Fix: Added support for .mov and .txt file uploads by correctly handling their MIME types (video/quicktime, text/plain).</li></ul><h4>1.6.3 - 14th May 2025</h4><ul><li>New: Introduced Advanced Form Styling.</li><li>Improvement: Enhanced Date Picker field to support manual text input in addition to the calendar picker.</li><li>Fix: Resolved an issue where conditional logic failed for number fields containing commas (e.g., “1,000”).</li></ul><h4>1.6.2 - 29th April 2025</h4><ul><li>New: Added more options for conditional logic.</li><li>Fix: Fixed calculation issues in multi-step forms caused by label formatting.</li></ul><h4>1.6.1 - 23rd April 2025</h4><ul><li>Improvement: Added entry logs for enabled webhooks.</li></ul><h4>1.6.0 - 16th April 2025</h4><ul><li>New: Added Digital Signature block in Pro Plan.</li><li>Improvement: Custom App – Added option to adjust response wait time with the server.</li></ul><h4>1.5.0 - 9th April 2025</h4><ul><li>New: Added support for Calculators in Business Plan.</li><li>New: Added “Show Value” support for Multi-choice and Dropdown fields.</li><li>New: Added prefix and suffix support to the Slider field.</li><li>New: Added functionality to hide the Submit button.</li><li>Improvement: SureTriggers is rebranded to OttoKit, added compatibility changes for a smooth transition.</li><li>Fix: Resolved functional bugs in conditional logic.</li></ul><h4>1.4.3 - 27th March 2025</h4><ul><li>Fix: Required field validation no longer triggers for hidden address fields in conditional logic.</li><li>Fix: Addressed a security bug. Props to Dmitrii Ignatyev for privately reporting it.</li></ul><h4>1.4.2 - 18th March 2025</h4><ul><li>Fix: Resolved a compatibility issue with SureTriggers where the response data type was not working correctly with the Custom App feature.</li></ul><h4>1.4.1 - 4th March 2025</h4><ul><li>Fix: Resolved an issue where selected Multiple Choice field values were not displayed correctly in entries if they contained commas.</li><li>Fix: Resolved an issue where dropdown conditional logic broke on the front end when SureForms was embedded in Bricks Builder.</li><li>Fix: Pressing SHIFT + ENTER now correctly triggers form validation instead of skipping it.</li></ul><h4>1.4.0 - 12th February 2025</h4><ul><li>New: Introduced Conversational Forms.</li><li>Fix: Addressed an issue where the default value was not reflected in the Rating block.</li><li>Fix: Fixed an issue where the time picker dropdown would collapse when the scrollbar was clicked.</li><li>Fix: Resolved an issue where the Custom App was not displaying results despite receiving a response from SureTriggers.</li></ul><h4>1.3.1 - 28th January 2025</h4><ul><li>Fix: Corrected the spelling of \"SureForms\" in field descriptions.</li></ul><h4>1.3.0 - 21st January 2025</h4><ul><li>New: Added a feature to edit entries.</li><li>New: Added an option to resend email notifications for one and multiple entries.</li><li>New: Added a feature to add entry notes.</li><li>Improvement: Added pagination and delete action to the entry logs interface.</li><li>Improvement: Updated CSS class names for conditional logic to resolve conflicts with generic class names like show and hide for improving code readability and compatibility.</li><li>Fix: Resolved an issue where conditional logic failed to trigger with GET parameters on page load.</li></ul><h4>1.2.4 - 7th January 2025</h4><ul><li>New: Added translations for the Italian, Portuguese, and Polish languages.</li></ul><h4>1.2.3- 31st December 2024</h4><ul><li>New: Added translations for the Spanish, German, French, and Dutch languages.</li></ul><h4>1.2.2 - 24th December 2024</h4><ul><li>New: Added conditional logic feature to webhooks for providing more flexibility in your workflows.</li><li>Fix: Resolved an issue with conditional logic in the Multiple Choice field to ensure it functions as expected.</li></ul><h4>1.2.1 - 17th December 2024</h4><ul><li>Improvement: Enhanced screen reader announcements for validation messages.</li><li>Improvement: Added keyboard navigation compatibility for the Rating block.</li><li>Improvement: Improved screen reader accessibility to announce block labels and help text on tab navigation.</li><li>Improvement: Made global validation messages dynamic for better adaptability.</li><li>Improvement: Added translation compatibility for validation message input labels in admin settings.</li><li>Improvement: Refined PHP logic to prevent multiple dots and spaces in the Upload field file types.</li><li>Fix: Fixed update notification issue when SureMembers is installed.</li></ul><h4>1.2.0 - 11th December 2024</h4><ul><li>New: Added Zapier integration.</li><li>Fix: Addressed an UI issue where the filenames in the Custom App responses were displayed incorrectly if they exceeded the character limit.</li><li>Fix: Resolved an issue in the Custom App where the response loader text didn't display correctly on the first load.</li></ul><h4>1.1.1 - 5th December 2024</h4><ul><li>Improvement: Optimized license validation queries to enhance admin loading times.</li><li>Fix: Corrected an issue with conditional logic in the Phone Number field.</li><li>Fix: Resolved an issue in the Custom App where HTML attributes were not rendering correctly in responses.</li><li>Fix: Fixed an issue where settings pages were hidden when the plugin title was translated.</li></ul><h4>1.1.0 - 28th November 2024</h4><ul><li>New: Custom App - Added support for downloading multiple files received in the SureTriggers response.</li><li>New: Custom App - Added a setting to change the response generation in progress text.</li><li>New: Custom App - Added a progress loader to indicate the percentage completion of the response being generated by SureTriggers.</li><li>New: Custom App - Added settings to display the response below the form or on the Confirmation page.</li><li>New: Custom App - Added settings to show or hide the Copy Text and Download All buttons for the displayed response.</li><li>Improvement: Enhanced page break functionality to announce the current page number.</li></ul><h4>1.0.5 - 19th November 2024</h4><ul><li>Improvement: Optimized accessibility for the Date Picker field.</li><li>Improvement: Added translation support for hardcoded UI text to improve localization.</li><li>Improvement: Enhanced dynamic height adjustment for conditional logic in multichoice field.</li><li>Fix: Corrected RTL alignment for all blocks.</li></ul><h4>1.0.4 - 12th November 2024</h4><ul><li>Fix: Ensured compatibility with WordPress 6.7.</li></ul><h4>1.0.3 - 6th November 2024</h4><ul><li>Improvement: Tab navigation for the Time Picker field.</li><li>Improvement: Optimized screen reader announcements for field labels, required status and descriptions.</li></ul><h4>1.0.2 - 31st October 2024</h4><ul><li>New: Custom App feature added in Business – Alpha release.</li><li>Improvement: Bulk edit options added for the slider field.</li></ul><h4>1.0.1 - 24th October 2024</h4><ul><li>Improvement: Added 'Enter key' support to add options in text-type slider field.</li><li>Fix: Hidden required fields in conditional logic no longer block form submission.</li><li>Fix: Added support for conditional logic in text slider field.</li></ul><h4>1.0.0 - 22nd October 2024</h4><ul><li>Initial release</li></ul>"
    }
}