{"translation-revision-date":"2025-12-14 03:17:40+0000","generator":"GlotPress\/4.0.3","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=2; plural=n != 1;","lang":"de"},"Block toolbar":["Symbolleiste blockieren"],"Avatar size":["Größe des Profilbilds"],"Thumb":["Vorschaubild"],"Toggle to display the user's mention name under their display name.":["Umschalten, um den Erwähnungsnamen des Benutzers unter seinem Anzeigenamen anzuzeigen."],"Include the user's mention name under their display name.":["Füge den Erwähnungsnamen des Benutzers unter seinem Anzeigenamen ein."],"Toggle to display the user's cover image over their display name.":["Umschalten, um das Titelbild des Benutzers über seinem Anzeigenamen anzuzeigen."],"Include the user's cover image over their display name.":["Füge das Titelbild des Benutzers über seinem Anzeigenamen ein."],"Toggle to display a link to the user's profile page under their display name.":["Umschalten, um einen Link zur Profilseite des Benutzers unter seinem Anzeigenamen anzuzeigen."],"Include a link to the user's profile page under their display name.":["Füge einen Link zur Profilseite des Benutzers unter seinem Anzeigenamen ein."],"Select another member":["Wähle ein anderes Mitglied"],"BuddyPress Member":["BuddyPress Mitglied"],"Display Cover Image":["Titelbild anzeigen"],"Full":["Gesamte Breite"],"Display Mention slug":["Mention Slug (Titelform) anzeigen"],"Display Profile button":["Button zur Anzeige des Profils"],"Start typing the name of the member you want to feature into this post.":["Beginne damit, den Namen des Mitglieds, das du vorstellen möchtest, in diesen Beitrag einzutragen."],"Member's username":["Nutzername des Mitglieds"],"Enter Member's username here…":["Gib hier den Benutzernamen des Mitglieds ein..."],"Select \"None\" to disable the avatar.":["Wähle „Keine“, um den Avatar zu deaktivieren."],"None":["Keine"],"Settings":["Einstellungen"]}},"comment":{"reference":"bp-members\/blocks\/member\/index.js"}}