{"translation-revision-date":"2026-01-18 15:53:16+0000","generator":"GlotPress\/4.0.3","domain":"messages","locale_data":{"messages":{"":{"domain":"messages","plural-forms":"nplurals=2; plural=n != 1;","lang":"de"},"You can't access this page.":["Du kannst nicht auf diese Seite zugreifen."],"feel free to recommend it to your friends or colleagues.":["du kannst es gerne an deine Freunde oder Kollegen weiterempfehlen."],"You have successfully activated Rank Math. If you find the plugin useful, ":["Du hast Rank Math erfolgreich aktiviert. Wenn du das Plugin nützlich findest, "],"your email account.":["dein E-Mail Konto."]," or ":[" oder "],"Google account, Facebook account":["Google-Konto, Facebook-Konto"],"The plugin is currently not connected with your Rank Math account. Click on the button below to login or register for FREE using your ":["Das Plugin ist derzeit nicht mit deinem Rank Math-Konto verknüpft. Klicke auf die Schaltfläche unten, um sich kostenlos anzumelden oder zu registrieren "],"Advanced Schema, Analytics and much more…":["Erweitertes Schema, Analytics und vieles mehr…"],"Next steps…":["Nächste Schritte…"],"Turn on auto-updates to automatically update to stable versions of Rank Math as soon as they are released. The beta versions of Rank Math as soon as they are released. The beta versions will never install automatically.":["Aktiviere die automatischen Updates, um automatisch auf stabile Versionen von Rank Math zu aktualisieren, sobald diese veröffentlicht werden. Die Betaversionen von Rank Math werden automatisch installiert, sobald sie veröffentlicht werden. Die Betaversionen werden nicht automatisch installiert."],"Failed! Try again":["Fehler! Versuche es erneut"],"You cannot turn on the Beta Tester feature because site wide plugins auto-update option is disabled on your site.":["Du kannst die Beta-Tester-Funktion nicht aktivieren, weil die Option zur automatischen Aktualisierung von Plugins auf deiner Website deaktiviert ist."],"You cannot turn on auto-updates to automatically update to stable versions of Rank Math as soon as they are released, because site wide plugins auto-update option is disabled on your site.":["Du kannst die automatischen Updates nicht aktivieren, um automatisch auf stabile Versionen von Rank Math zu aktualisieren, sobald diese veröffentlicht werden, da die Option für die automatische Aktualisierung von Plugins auf deiner Website deaktiviert ist."],"Saving…":["Wird gespeichert …"],"PRO options are enabled.":["PRO-Optionen sind aktiviert."],"More powerful options are available in the PRO version.":["Leistungsfähigere Optionen sind in der PRO-Version verfügbar."],"Something went wrong! Please try again.":["Etwas ist schiefgelaufen! Bitte erneut versuchen."],"Buy":["Kaufen"],"24\/7 Support":["24\/7-Support"],"Powerful Schema Generator":["Leistungsstarker Schema-Generator"],"Track 500 Keywords":["500 Schlüsselwörter verfolgen"],"Free 15 Content AI Credits":["15 kostenlose KI-Guthaben für Inhalte"],"Unlimited personal websites":["Unbegrenzte persönliche Websites"],"Take SEO to the Next Level!":["Bring SEO auf die nächste Stufe!"],"NEW!":["NEU!"],"Earn flat 30% on every sale!":["Verdiene pauschal 30 % bei jedem Verkauf!"],"Affiliate Program":["Partnerprogramm"],"Upgrade to PRO":["Auf PRO upgraden"],"Update Notification Email":["Update Benachrichtigungs E-Mail"],"When auto-updates are turned off, you can enable update notifications, to send an email to the site administrator when an update is available for Rank Math.":["Wenn die automatischen Updates deaktiviert sind, kannst du Update-Benachrichtigungen aktivieren, um eine E-Mail an den Seiten-Administrator zu senden, wenn ein Update für Rank Math verfügbar ist."],"Free":["Kostenlos"],"PRO":["PRO"],"Saved":["Gespeichert"],"Improve SEO Score":["SEO-Bewertung verbessern"],"Import Data":["Daten importieren"],"Disconnect Account":["Konto trennen"],"Connect Now":["Jetzt verbinden"],"Not Connected":["Nicht verbunden"],"Connected":["Verbunden"],"Account":["Konto"],"Import & Export":["Import & Export"],"Beta Tester":["Beta-Tester"],"It is not recommended to use the beta version on live production sites.":["Es wird nicht empfohlen, die Beta-Version auf Live-Produktionsstandorten zu verwenden."],"You can take part in shaping Rank Math by test-driving the newest features and letting us know what you think. Turn on the Beta Tester feature to get notified about new beta releases. The beta version will not install automatically and you always have the option to ignore it.":["Du kannst an der Gestaltung von Rank Math mitwirken, indem du die neuesten Funktionen ausprobierst und uns deine Meinung mitteilst. Schalte die Funktion Beta-Tester ein, um über neue Beta-Versionen benachrichtigt zu werden. Die Betaversion wird nicht automatisch installiert und du hast immer die Möglichkeit, sie zu ignorieren."],"Beta Opt-in":["Beta Opt-in"],"Reinstalling, please wait…":["Neuinstallation, bitte warte…"],"Install Version ":["Installationsversion "],"Roll back to this version.":["Gehe zu dieser Version zurück."],"Rollback Version":["Rollback Version"],"This is the latest version of the plugin.":["Dies ist die neueste Version des Plugins."],"Update Now":["Jetzt aktualisieren"],"Latest Stable Version":["Neueste stabile Version"],"This is the version you are using on this site.":["Dies ist die Version, die du auf dieser Seite verwendest."],"You are using the latest version of the plugin.":["Du nutzt die neueste Version des Plugins."],"Rolled Back Version: ":["Rollback-Version: "],"Auto updates will not work, please update the plugin manually.":["Automatische Updates funktionieren nicht. Bitte aktualisiere das Plugin manuell."],"Your Version":["Deine Version"],"Warning: ":["Warnung: "],"Previous versions may not be secure or stable. Proceed with caution and always create a backup.":["Frühere Versionen sind möglicherweise nicht sicher oder stabil. Gehe vorsichtig vor und erstelle immer ein Backup."],"If you are facing issues after an update, you can reinstall a previous version with this tool.":["Wenn du nach einem Update auf Probleme stößt, kannst du mit diesem Tool eine frühere Version erneut installieren."],"Rollback to Previous Version":["Rückkehr zur vorherigen Version"],"Rank Math will not auto-update because you have rolled back to a previous version. Update to the latest version manually to make this option work again.":["Rank Math wird nicht automatisch aktualisiert, da du auf eine frühere Version zurückgesetzt hast. Aktualisiere manuell auf die neueste Version, damit diese Option wieder funktioniert."],"Auto Update Plugin":["Plugin automatisch aktualisieren"],"Version Control":["Versionskontrolle"],"Save Changes":["Änderungen speichern"],"Auto Update":["Automatische Aktualisierung"],"Settings":["Einstellungen"],"Direct help from our qualified support team":["Direkte Hilfe durch unser qualifiziertes Support-Team"],"Ticket Support":["Ticket-Support"],"Understand all the capabilities of Rank Math":["Verstehe alle Fähigkeiten von Rank Math"],"Online Documentation":["Online-Dokumentation"],"Product Support":["Produkt Support"],"How to Make Your Posts Pass All the Tests":["Wie man seine Beiträge alle Tests bestehen lässt"],"How to Import Data from Your Previous SEO Plugin":["So importierst du Daten aus deinem vorherigen SEO-Plugin"],"How to Properly Setup Rank Math":["Wie man die Rank Math richtig einstellt"],"Setup Rank Math":["Einrichten von Rank Math"],"Setup Wizard":["Einrichtungsassistent"],"Help":["Hilfe"],"Modules":["Module"],"Dashboard":["Dashboard"]}},"comment":{"reference":"assets\/admin\/js\/modules.js"}}